<?php
includeCSS(['modules/general', 'modules/fonts', 'modules/header', 'modules/breadcrumb', 'modules/content']);
include DOCUMENT_ROOT . '/view/v3/head.php';
?>
<body>
<?php include DOCUMENT_ROOT . '/view/v3/menu.php'; ?>
<main class="container">
    <ul class="breadcrumb">
        <li><a href="/">Главная</a></li>
        <li><a href="/blog">Блог</a></li>
        <li class="active">Новый личный беговой рекорд</li>
    </ul>
    <article class="content">
        <h1>Новый личный беговой рекорд</h1>
        <time class="date-pub">28 апреля 2021</time>

        <span>Содержание:</span>
        <ul class="post-nav">
            <li><a href="#a-1">Введение</a></li>
            <li><a href="#a-2">Зачем мне это надо было</a></li>
            <li><a href="#a-3">Тяжело ли долго бегать</a></li>
            <li><a href="#a-4">Идеальные условия</a></li>
            <li><a href="#a-5">Рекордный вечер</a></li>
            <li><a href="#a-6">Честно обмани себя</a></li>
            <li><a href="#a-7">Особенности моего бега</a></li>
            <li><a href="#a-8">Ну а что дальше</a></li>
        </ul>

        <h2 id="a-1">Введение</h2>
        <p>Сегодня я установил личный рекорд по бегу. <b>16 километров 200 метров</b> без единой остановки. Вся эта дистанция далась мне ровно за <b>полтора часа</b>. Это было одной из моих целей на этот год и на удивление я достиг ее уже к концу апреля.</p>
        <div><img style="max-height: 450px; margin: auto" class="post-img" src="/images/blog/run/run2.jpg" alt="image"></div>

        <h2 id="a-2">Зачем мне это надо было</h2>
        <p>Моя работа в первую очередь ассоциируется с сидячим образом жизни. Летом 2018 года я стал себя в целом сильно хуже чувствовать. У меня были не свойственные для возраста отдышка, повышенное потоотделение, повышенная утомляемость. Когда я прошел обследование врачи поставили мне тахикардию (учащенное сердцебиение). При том что у меня никто не было проблем с сердцем, а все свое детство и подростковый период я провел активно играя а футбол. С тех пор я почувствовал себя стариком и в 25 я понял, что надо что-то менять и возвращаться в спорт (хотя бы в любительский). </p>

        <h2 id="a-3">Тяжело ли долго бегать</h2>
        <p>Самая первая моя пробежка длилась всего 800 метров. Во время нее у меня гудели ноги, выпрыгивало сердце, кололо в боку и не хватало воздуха в легких. Было тяжело осознавать что заброшенный спорт всего на 3-4 года после детства и подросткового периода так мгновенно улетучился из моего организма и я заржавел. </p>
        <p>Тем не менее я продолжал бегать, а бегал я только на улице на свежем воздухе. Иногда даже в дождь (если не успевал закончить пробежку к моменту когда его нету) и конечно же  бегал и в мороз.  На протяжении всего этого периода, а прошло почти 3 года не было ни одного месяца, когда я бы не бегал. В более теплое время года интенсивность моих пробежек доходило до 2ух в неделю. Или же одна пробежка и одна игра в футбол. Да-да, помимо бега я вернулся и в футбол. Хотя сейчас не так часто в него играю. В более холодное время года я мог бегать всего 1-2 раза в месяц. Главное правило первых лет зимнего бега: не бежать если холоднее -10 градусов. Так за первый год я вышел на уровень в 6-8 километров за пробежку. При этом во время пробежки я мог делать остановки в 1-2 минуты для восстановления сил.</p>
        <p>На второй год я значительно увеличил это расстояние и в среднем бегал по 9-13 километров. Перешел с пробежек по улицам на пробежку по стадиону. Перерывы и остановки во время бега практически сошли на нет и я преодолевал дистанции без передышек. А в один идеальный летний вечер для бега без остановок мне покорилась отметка в <b>15 километров 100 метров</b>, что тогда и стало моим рекордом. Та дистанция <b>заняла 1 час 25 минут</b>. </p>
        <p>В этом году я так же не сбавлял обороты и бегал даже при большом морозе, когда термометр опускал до отметки -16 градусов.  Я планировал побить свой рекорд уже летом, когда выйду на пиковую форму года, однако понял, что могу это сделать уже в конце апреля.</p>
        <div><img style="max-height: 450px; margin: auto" class="post-img" src="/images/blog/run/run3.jpg" alt="image"></div>
        <p>Я не сильно разбираюсь в методиках бега, однако читая одну книгу по программированию я узнал, что существует позный метод бега. Да-да, отрою тайну: книги о программировании не только о программировании, но и о многом другом. Ведь как по другому еще объяснить какие-то сложные вещи если не примерами из реальной жизни. Так вот иногда я пытался смешивать обычный бег с позным, но чаще всего бегал обычным. </p>
        <p>Заканчивая раздел и отвечая на его главный вопрос “Тяжело ли долго бегать” однозначного ответа не будет. Физически нет. Особенно если подобрать идеальные условия для бега. Психологически невероятно тяжело. Приходить на стадион и знать, что ближайший час - полтора ты будешь насиловать себя сил не прибавляет.</p>

        <h2 id="a-4">Идеальные условия</h2>
        <p>Существует несколько условий для бега, которые за несколько лет я сумел для себя сформировать:</p>
        <ul>
            <li>Не бегать в сильный ветер. Это правило не случайно стоит на первом месте. Сильный ветер отнимает невероятно много сил. Даже при беге по кругу, где пол круга ветер тебе помогает, а пол круга замедляет фактор замедления сильнее фактора помощи.</li>
            <li>Правильно одеваться. Зимой нужны перчатки и шапка. А еще куртка байка или что-то другое теплое. Летом, зимой и осенью при теплой погоде я бегаю в шортах и майке.</li>
            <li>Подождать часа 2-3 после плотного приема пищи. Сам прием пищи для меня не сильно влияет на качество бега. Так например в прошлом году <strike>утром я поиграл в плейстейшен а вечером выиграл чемпионат мира (Андреа Пирло)</strike> в обед поел пельмешей, а вечером поставил рекорд.</li>
            <li>В солнечную и жаркую погоду днем также очень тяжело бегать.</li>
            <li>Влажность воздуха так же имеет значение.</li>
            <li>Психологический настрой пусть в меньшей степени, но все же так же влияет на качество бега.</li>
        </ul>

        <h2 id="a-5">Рекордный вечер</h2>
        <p>Как я уже писал выше бегать большие дистанции невероятно тяжело психологически. Поставив рекорд в прошлом году я понял 2 вещи:<br>
            1) Я хочу его хоть немного улучшить.<br>
            2) Пока я не знаю как настроиться психологически пробежать снова так долго.</p>

        <p>Забегая на перед скажу, что сегодня я не планировал ставить рекорд. Я думал пробежать всего 11 километров. Каждую пробежку прибавляя на метров 200 я планировал летом выйти на пиковую форму и поставить рекорд. И так, побежали. Оприходовав банан я не дождался 2ух часов и уже мин через 40 пошел на пробежку. Уже после 2ух кругов, которые я обычно преодолеваю налегке бег все равно давался тяжело. Потом я понял что чтобы банан дал энергетический эффект его надо было съесть, а не засунуть в задницу и бежать. Но да шутки в сторону. Я просто начал с позного метода, который оказался чуть быстрее моего обычного и я в самом начале забега не был готов к такой скорости. Затем я перешел на обычный режим и километров до 12 так и бегал. После чего стал переодически чередовать способы бега.</p>

        <p>Не смотря на то, что ближе к 3ему километру мое дыхание выровнялось, я не чувствовал никакого дискомфорта в ногах и не слышал работы моего сердца я все равно ловил себя на мысли, что мне еще здесь бегать невероятно долго. В такие моменты время для тебя не просто замедляется, а останавливается. Есть только 2 вещи которые помогают тебе отвлечься от бега: музыка и уход в себя (полное отвлечение от бега). Тогда ты почти не замечая можешь наматывать километры. В такое время самое главное не смотреть в телефон сколько пробежал, ведь тогда твой мозг условно начинает считать сколько кругов осталось, ты снова концентрируешься на беге, время снова останавливается и тебе снова тяжело психологически. На счет физического состояния после километров 5-6 ты выходишь на уровень, когда тебе все равно сколько бежать 10 километров или 15, если конечно не думать о беге и не считать каждый круг. Еще очень важно при достижении такого состояния не останавливается и не отдыхать. Возобновлять пробежку сложнее, чем молча бежать через силу.</p>

        <h2 id="a-6">Честно обмани себя</h2>
        <p>В оба вечера, когда я ставил свои рекорды я обманывал себя. При этом это была искренняя ложь в которую я сам наивно верил. Прошлым летом пробежка давалась мне так же тяжело (скорее физически, чем психологически).. После первых 6 кругов (что бы вы понимали 15-16 километров это где-то 35-40 кругов) придя на стадион я искренне думал что я сделаю несколько перерывов после каждых 6-8 кругов. Сделаю 3-4 перерыва и суммарно отбегаю кругов 30 и пойду домой. Однако пробежав 6 кругов я запретил себе отдыхать и сказал что отдохну после 7го круга. Пробежал 7 кругов я перенес отдых на 8ой. С 8го на 9ый. Пробежав 9 я себя обманул таким же образом ловя себя на мысли что я недостаточно устал и могу еще круг и не могу себе позволить остановится. Так я себя обманывал круга до 15 после чего понял, что нет смысла делать даже 1 перерыв и я смогу всю дистанцию пробежать без остановок (физически мой организм принял бег, а психологически я старался все больше и больше отвлечься). Точно так же я себе запрещаю отдыхать в любой день пробежки и выходя на пробежку я уже заранее знаю, что врядли я присяду отдыхать и все равно буду бежать всю дистанцию за 1 раз.</p>
        <p>Сегодня был обман другого плана. Я не планировал себе перерывы и уже год не делаю их. Однако выходя на пробежку я планировал пробежать 12 километров и пойти домой. Не раз во время пробежки я ловил себя на мысли что если мне 12 так сложно психологически, как же я пробежал 15 и как же мне в этом году пробежать еще больше. Данные мысли я старался подавить музыкой и переодически уходил в себя и не думал о беге. Рано или поздно я достал айфон посмотреть сколько мне осталось до 12 километров ибо примерное расстояние я и так знал и оставалось кругов 6, но хотелось знать точно. В этот момент уже было 9.5 км и я поймал себя на мысли, что я почти совсем не устал и задал себе вопрос “Почему бы не поставить рекорд уже сегодня?”. Осознание того, что можно не дожидаться лета, а сделать это сейчас придало мне еще больше энтузиазма и психологических сил. Ведь до рекорда мне уже бежать не 15 км, а всего-то 6. Не полтора часа, а каких-то минут 30 всего. Собственно именно так я себя обманул второй раз и второй раз обновил рекорд.</p>

        <h2 id="a-7">Особенности моего бега</h2>
        <p><b>Начнем со скорости.</b> Сложность оценивать реальную скорость бега (даже с учетом приложения). Конечно же я не ношусь по стадиону, но мой бег и близко нельзя назвать бегом трусцой. Немного быстрее среднего, именно так я бы охарактеризовал свой бег. Если вы хотите сравнить его со своим вам не составит труда это сделать. Обычно в теплую погоду поздними вечерам по стадиону бегают много людей. Так вот на 10 бегущих одновременно человек, моя скорость бега такова, что я обгоняю примерно 5-6 человек. Еще 2-3 бегут со мной одинаково. И только 1-2 человека действительно способны меня обогнать. При этом испытываешь небольшое чувства удовлетворения, когда медленных ты обгоняешь по второму или даже третьему кругу. Или когда люди которые приходят бегать позже тебя все равно уходят раньше.</p>
        <p><b>Питание.</b> Про питание я частично уже писал. Не особо влияет то что я ел, главное чтобы до пробежки прошло какое-то время иначе покалывания в боку и небольшие отрыжки со вкусом того что ты ел тебе обеспечены.</p>
        <p><b>Ванна после бега.</b> Да, именно ванна, а не душ. Минут 30 минимум я в ней откисаю как Маслов в бочке с яблоками. Возможно это и есть одна из причин почему после даже зимней пробежки у меня нет ангины.</p>
        <p><b>Город или стадион.</b> Изначально я бегал первые года полтора по улице, затем перешел на стадион. Бег по стадиону мне более симпатичен хотя у обоих методах есть как преимущества , так и недостатки. Перечислю недостатки обоих.<br>
        <p>Для города:</p>
        <ul>
            <li>Часто неровные поверхности, то с горки, то под горку</li>
            <li>Мешают машины и светофоры</li>
            <li>Мешают собаки</li>
            <li>Местами лужи после дождя</li>
        </ul>
        <p>Для стадиона:</p>
        <ul>
            <li>Круговой бег неплохо бьет по психологическому состоянию</li>
            <li>Если кто-то тренируется, то регулярно слышишь фразу “подайте мяч” (именно по этому у меня не идеально ровные круги при беге на стадионе)</li>
        </ul>
        <p>Бег по паркам я бы прировнял к бегу по городу: неровная поверхность, собаки, лужи. Поэтому для себя почти всегда последнее время я выбираю стадион.</p>


        <h2 id="a-8">Ну а что дальше</h2>
        <p>Пока у меня нет ответа на этот вопрос. Физически я был готов пробежать наверно и все 20, но не стал без привычки после 10-11 км насиловать свой организм и в двое увеличивать дистанцию. Поставлю ли я новый рекорд? Тоже вопрос открытый. Если переборю себя психологически. Найду новый способ себя обмануть или целенаправленно задамся целью пробежать больше 16.2 км возможно однажды я это и сделаю. Однако я не разделяю мнение, что обычному программисту - любителю стоит бросать вызов профессиональным бегунам и бежать по 30-40 км и более. Хотя физически я бы наверно смог. Меня часть спрашивают почему я не принимаю участие в различных любительских марафонах. На это есть 2 причины. (Где-то плачет Игорь Николаев, что не 5 причин.) Во - первых я бегаю для себя, а не для каких-то марафонов. Во - вторых марафоны всегда проходит в выходные в первой половине дня. Нормальные люди спят в это время.</p>
        <p>Одно я знаю точно, что я не собираюсь закидывать бег и вы еще увидеть много овальных сториес (с элементам “Подайте мяч”) у меня в инстаграмме. </p>
        <p>Закончу тем, с чего начал. Дал ли мне что-то бег? Думаю да! Бег полезен для организма в целом и я не стану перечислять все его преимущества, которые можно найти в интернете от улучшения работы сердечной и дыхательной системы до разгона лимфы. Самое главное у меня больше нет тахикардии, я снова чувствую себя подросткам в плане физических нагрузок при ходьбе / беге. Могу смело без отдышки спускаться и подниматься по лестнице. После старости пришла юность и я больше не позволю себе ржаветь.</p>

    </article>

</main>
<?php include DOCUMENT_ROOT . '/view/v3/footer.php'; ?>
<?php include DOCUMENT_ROOT . '/view/v3/js-scripts.php'; ?>
</body>
</html>
